Tekla Open API Reference for Tekla Structures 2025
Reinforcement.RebarOffsetTypeEnum Enumeration
 The different types of offsets.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum RebarOffsetTypeEnum
Public Enumeration RebarOffsetTypeEnum
Members
Member name | Value | Description
OFFSET_TYPE_COVER_THICKNESS | 0 |  The concrete cover thickness.
OFFSET_TYPE_LEG_LENGTH | 1 |  The leg length.
See Also
Reference
Tekla.Structures.Model Namespace